
** camget

#+BEGIN_SRC sh :results drawer
camget sha1-5394306642205eeddac2b485a24ae5dc325923a3
#+END_SRC

#+RESULTS:
:RESULTS:
{"camliVersion": 1,
  "camliType": "file",
  "fileName": "data-waking.gif",
  "parts": [
    {
      "blobRef": "sha1-f80dd7619873c8bddab7c771bec72f89781c7643",
      "size": 262144
    },
    {
      "blobRef": "sha1-aa396b26d7250165a7e60a771724e41fa619ed8a",
      "size": 76812
    },
    {
      "blobRef": "sha1-493cf2f502f911dd6d1b9b6eb1e1a1d18067b2e2",
      "size": 87174
    },
    {
      "blobRef": "sha1-881edd8e34656c70252eb2e003c43ed359ec3f71",
      "size": 69239
    },
    {
      "blobRef": "sha1-6a5f33664547b128ab8cd3145d476f91e7dbb714",
      "size": 69873
    },
    {
      "blobRef": "sha1-dff0faae2dfa64e2a502ac6bea64185c49a9243a",
      "size": 68827
    },
    {
      "blobRef": "sha1-2a48fc81459bae5edeedd33286d93c00e4d45fc2",
      "size": 66652
    },
    {
      "blobRef": "sha1-82c6e3e12679024bfa1fec1c1242e526fa53813b",
      "size": 73211
    },
    {
      "bytesRef": "sha1-deb56434896a564e9d40ae7cabafe0b67fc6cdb5",
      "size": 132586
    },
    {
      "blobRef": "sha1-76bcf539f244aca668e18c7f7dfdae346aa0c78e",
      "size": 74174
    },
    {
      "blobRef": "sha1-af59e0102b4a4992eb84c85935f608a825753df7",
      "size": 58026
    }
  ],
  "unixCtime": "2016-03-26T19:41:07.196167749Z",
  "unixGroup": "root",
  "unixGroupId": 0,
  "unixMtime": "2016-03-26T19:37:46.729493759Z",
  "unixOwner": "dru",
  "unixOwnerId": 1000,
  "unixPermission": "0755"
}
:END:

But it's suggested that camtool is more what you want to use. 

** camtool

#+BEGIN_SRC sh :results drawer
jo "camliNodeType"="pinboard.in:post"
#+END_SRC

#+RESULTS:
:RESULTS:
{"camliNodeType":"pinboard.in:post"}
:END:


#+BEGIN_SRC sh :results drawer
camtool search '{"camliNodeType":"pinboard.in:post"}'
#+END_SRC

#+RESULTS:
:RESULTS:
{
  "blobs": null,
  "description": null
}
:END:

Why? Why doesn't that JSON constraint get me the right thing? 

   

